[{"number":129,"id":"I_kwDONwA1O867wsy_","title":"Machine Account and Key Management","body":"### High-Level Summary\n\nThis epic tracks the implementation of secure, scalable machine account and machine account key management for the Datum Cloud platform, leveraging Zitadel as the external authentication provider. \nThe work will be split between the milo repository (for CRDs and API types) and the new`auth-provider-zitadel` repository (for controllers, reconciliation logic, and Zitadel integration).\n\n### Motivation\n\nAs the platform grows, there is a need for robust, enterprise-grade management of machine/service accounts and their cryptographic keys. This enables secure automation, CI/CD, and workload identity, while aligning with industry best practices and compliance requirements. Integrating Zitadel as the auth provider allows us to delegate sensitive operations and leverage a mature, external identity platform.\n\n### Goals\n\n- Define and implement Kubernetes-native CRDs for machine accounts and keys in milo.\n- Build controllers in `auth-provider-zitade`l to reconcile these resources with Zitadel.\n- Support secure key lifecycle management (creation, registration, rotation, revocation).\n- Enable secure, short-lived token exchange for machine accounts.\n- Provide audit logging and user-facing documentation.\n\n### Non-Goals\n\n- User authentication flows (handled elsewhere).\n- UI or CLI tooling for resource management.\n- Direct user interaction with Zitadel outside of the automated controllers.","url":"https://github.com/datum-cloud/enhancements/issues/129","labels":{"nodes":[{"name":"Identity and Access Management"},{"name":"Datum Cloud"},{"name":"Milo"},{"name":"Roadmap Vote"}]},"createdAt":"2025-06-16T13:49:25Z"},{"number":52,"id":"I_kwDONwA1O86vn_Yv","title":"Enterprise Ready ","body":"Most SaaS providers gate enterprise features behind high-tier plans — but public clouds don’t. Datum Cloud brings those capabilities to all users, so every organization can operate with power and safety from the start.\n\n---\n\n### Access & Authorization\n\n- **Social Signup and Login**  \n  - Support for GitHub and Google sign-up and login  \n  - Org admins can enforce Google Login for all users\n\n- **Active Sessions**  \n  - Provide visibility to users for into all active sessions  \n  - Allow users to revoke sessions to maintain account security\n\n- **Machine Accounts**  \n  - Introduce machine identities for programmatic access to the platform  \n  - Enable automation and service-to-service integrations without human intervention  \n  - Use standard authentication and permission models\n\n---\n\n### Team Management\n\n- **Standard Organizations**  \n  - Users can create organizations for team collaboration  \n  - Org admins can manage members and permissions\n\n- **List Members & Invites**  \n  - View current team members and pending invitations  \n  - Resend or cancel pending invitations\n\n- **Remove or Adjust Members**  \n  - Remove users from teams and automatically revoke all active sessions\n  - Owners and Admins can edit roles of existing members\n\n---\n\n### Fine-Grained Permissions (RBAC / ABAC)\n\n> The first step in becoming Enterprise Ready is to move beyond coarse global roles toward fine-grained access control — defining what users can do by area, not just by title.\n\n<details>\n<summary>View Role Matrix</summary>\n\n#### Top-Level Roles\n- Owner  \n- Editor (to be created)  \n- Viewer (to be created)\n\n#### IAM Roles\n- IAM Admin  \n- IAM Editor  \n- IAM Viewer (rename “Reader” → “Viewer”)\n\n#### Resource Management\n- Organization Admin — manage org and membership  \n- Organization Viewer — view org and membership  \n- Project Admin — manage project-level resources  \n- Project Viewer — view project-level resources\n\n#### Telemetry\n- Telemetry Admin  \n- Telemetry Viewer\n\n#### Networking\n- Networking Admin  \n- Networking Viewer\n\n#### Domains & Gateway\n- Domain Admin  \n- Domain Viewer  \n- Gateway Admin  \n- Gateway Viewer\n\n</details>\n\n---\n\n### Audit Logs\n\n- Centralized stream of all user activity within an organization  \n- Fully exportable and API-accessible  \n- Searchable via portal interface or CLI  \n","url":"https://github.com/datum-cloud/enhancements/issues/52","labels":{"nodes":[{"name":"Datum Cloud"},{"name":"Milo"},{"name":"Roadmap Vote"}]},"createdAt":"2025-03-25T13:12:24Z"},{"number":36,"id":"I_kwDONwA1O86s7FyM","title":"Machine Identity & Machine Keys","body":"### Overview\n\nThis enhancement tracks the development of machine identities and machine keys within the IAM system. Machine identities enables machines to authenticate and interact securely with platform resources. Machine keys will provide a mechanism for machines to exchange self-signed JWTs for short-linked tokens (using [RFC 7523](https://datatracker.ietf.org/doc/html/rfc7523)) that can be used to authenticate with the Datum Cloud platform.\n\nService accounts can be bound to IAM policies just like human users to grant a service account permission to a resource.\n\n### Expected Impact\n\n- Enables fine-grained access for machines manage platform resources\n- Provides a secure way for machines to exchange sensitive credentials for short-lived access tokens without Datum Cloud ever storing the secret key. \n\n### Additional Context\n\n### Machine Identity\n\nMachine Identities will be project level resources and be given a unique email address based on the machine identity name specified by the user at creation and the ID of the project the service account is created in.\n\nExample machine identity email:\n```text\nmy-service-account@my-datum-project.iam.datumapis.com\n```\n\n#### Assigning roles in an IAM policy\n\nThe machine identity email can be used to bind a machine to a role on a resource through an IAM policy.\n\n```yaml\nname: resourcemanager.datumapis.com/projects/{project-name}\nspec:\n  bindings:\n    - role: services/compute.datumapis.com/roles/workloadAdmin\n      members:\n        - machine:iam-operator@datum-cloud.iam.datumapis.com\n```\n\n### Machine Keys\n\nMachine keys can be created as a way for machines to authenticate with the Datum Cloud platform. Users will use a Datum-managed key where the private key is generated automatically by Datum and returned to the user at key creation or a user-managed key where the user generates a private key on their system and provides Datum with the public key. \n\n> [!IMPORTANT]\n>\n> We should encourage users to rotate machine keys periodically based on the needs of their organization. \n\n## References\n \n- [Google Cloud Platform Service Accounts](https://cloud.google.com/iam/docs/service-account-overview)\n- [JSON Web Token (JWT) Profile for OAuth 2.0 Client Authentication and Authorization Grants (RFC-7523)](https://datatracker.ietf.org/doc/html/rfc7523)\n","url":"https://github.com/datum-cloud/enhancements/issues/36","labels":{"nodes":[{"name":"Identity and Access Management"},{"name":"Datum Cloud"},{"name":"Milo"},{"name":"Roadmap Vote"}]},"createdAt":"2025-03-06T18:49:08Z"}]
